<!DOCTYPE html>
<html>

<head>
  <meta charset="utf-8">
  <style>
    body {
      display: flex;
      justify-content: center;
      flex-direction: column;
    }

    h1 {
      margin: 120px auto 30px;
    }

    h3 {
      margin: 0px auto 60px;
    }

    ul {
      margin: auto;
      display: flex;
      flex-direction: column;
      gap: 10px;
      list-style: none;
    }

    li {
      padding: 5px;
      border: 2px solid #6398F3;
      transition: 0.3s;
    }

    li:hover {
      background-color: #6398F3;
      color: #000;
    }

    a {
      color: #6398F3;
      text-decoration: none;
    }

  </style>
</head>

<body>
  <h1>Курсова робота з "Організації Баз Даних"</h1>
  <h3>Виконав студент третього курсу групи КА-01 Гаврилюк І.В.</h3>

  <ul>
    <a href="task1.php">
      <li>
        1. Отримати перелік всіх частин військового округу, зазначеної армії, бригади та їх командирів.
      </li>
    </a>

    <a href="task2.php">
      <li>
        2. Отримати дані по офіцерському складу в цілому і по офіцерському складу зазначеного звання всіх частин військового округу, окремої армії, дивізії, корпусу, військової частини.
      </li>
    </a>

    <a href="task3.php">
      <li>
        3. Отримати дані по рядовому і сержантському складу в цілому і з урахуванням зазначеного звання всіх частин військового округу, окремої армії, дивізії, корпусу, військової частини.
      </li>
    </a>

    <a href="task4.php">
      <li>
        4. Отримати ланцюжок підпорядкованості знизу доверху для зазначеного військовослужбовця.
      </li>
    </a>

    <a href="task5.php">
      <li>
        5. Отримати перелік місць дислокації всіх частин військового округу, окремої армії, дивізії, корпуси, військової частини.
      </li>
    </a>
    <a href="task6.php">
      <li>
        6. Отримати дані про наявність бойової техніки в цілому та з урахуванням зазначеної категорії або виду в усіх частинах військового округу, окремої армії, дивізії, корпусі, військовій частині.
      </li>
    </a>
    <a href="task7.php">
      <li>
        7. Отримати перелік споруд зазначеної військової частини, перелік споруд, де дислоковано більше одного підрозділу, де не дислоковано жодного підрозділу.
      </li>
    </a>
    <a href="task8.php">
      <li>
        8. Отримати перелік військових частин, в яких число одиниць зазначеного виду бойової техніки більше 5 (немає зазначеної бойової техніки).
      </li>
    </a>
    <a href="task9.php">
      <li>
        9. Отримати дані про наявність озброєння в цілому і з урахуванням зазначеної категорії або виду в усіх частинах військового округу, окремої армії, дивізії, корпусі, військовій частині.
      </li>
    </a>
    <a href="task10.php">
      <li>
        10. Отримати перелік військових спеціальностей, за якими в окрузі, окремої армії, дивізії, корпусі, військової частини більше п'яти фахівців (немає фахівців).
      </li>
    </a>
    <a href="task11.php">
      <li>
        11. Отримати перелік військовослужбовців зазначеної спеціальності в окрузі, окремої армії, дивізії, корпусі, військової частини, у зазначеному підрозділі деякої військової частини.
      </li>
    </a>
    <a href="task12.php">
      <li>
        12. Отримати перелік військових частин, в яких число одиниць зазначеного виду озброєння більше 10 (нема зазначеного озброєння).
      </li>
    </a>
    <a href="task13.php">
      <li>
        13. Отримати дані про армію, дивізії, корпусі, в які входить найбільше (найменше) військових частин.
      </li>
    </a>
  </ul>
</body>

</html>